app/views/users/index.html.erb

SELECT "roles"."name" FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = $1  [["user_id", 10]]
---

  <%=user.roles.pluck(:name) %>