app/views/layouts/application.html.erb

SELECT "roles"."name" FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = $1  [["user_id", 1]]
---
    <p>Role is admin or not <strong><%= current_user.has_role? :admin %></strong> </p>
    <p><%= current_user.roles.pluck(:name) %></strong> </p>